ecdr/elua/src/platform/lm3s/platform.c
int platform_s_timer_set_match_int( unsigned id, timer_data_type period_us, int type )
{
  u32 base = timer_base[ id ];
  u64 final;

  if( period_us == 0 )
  {
    MAP_TimerDisable( base, TIMER_A );
    MAP_TimerIntDisable( base, TIMER_TIMA_TIMEOUT );
    MAP_TimerIntClear( base, TIMER_TIMA_TIMEOUT );
    MAP_TimerLoadSet( base, TIMER_A, TIMER_MAX_COUNT );
    MAP_TimerEnable( base, TIMER_A );
    return PLATFORM_TIMER_INT_OK;
  }
  final = ( ( u64 )period_us * MAP_SysCtlClockGet() ) / 1000000;
  if( final == 0 )
    return PLATFORM_TIMER_INT_TOO_SHORT;
  if( final > 0xFFFFFFFFULL )				// todo: check
    return PLATFORM_TIMER_INT_TOO_LONG;
  lm3s_timer_int_periodic_flag[ id ] = type;
  MAP_TimerDisable( base, TIMER_A );
  MAP_TimerIntClear( base, TIMER_TIMA_TIMEOUT );
  MAP_TimerLoadSet( base, TIMER_A, ( u32 )final - 1 );
  return PLATFORM_TIMER_INT_OK;
}

// ****************************************************************************
// PWMs
// Similar on LM3S8962 and LM3S6965
// LM3S6918 has no PWM


#if ( NUM_PWM > 0 )
// #ifdef BUILD_PWM


// PWM Clock
#ifdef EMULATE_PWM
// TODO: Implement clock divisors (at moment just uses system clock)

#else // EMULATE_PWM

// SYSCTL div data and actual div factors
const static u32 pwm_div_ctl[] = { SYSCTL_PWMDIV_1, SYSCTL_PWMDIV_2, SYSCTL_PWMDIV_4, SYSCTL_PWMDIV_8, 
	SYSCTL_PWMDIV_16, SYSCTL_PWMDIV_32, SYSCTL_PWMDIV_64 };

const static u8 pwm_div_data[] = { 1, 2, 4, 8, 16, 32, 64 };
#endif // EMULATE_PWM


#if defined( EMULATE_PWM )

static BOOL pwm_enabled[NUM_PWM] = { FALSE };

#if defined( FORLM4F120 ) 
const static u32 pwm_timer_base[] = { WTIMER0_BASE, WTIMER1_BASE, WTIMER2_BASE,
					WTIMER3_BASE, WTIMER4_BASE, WTIMER5_BASE };
// FIXME: Remove wide timers from timer area if using them for PWMs

const static u32 pwm_timer_sysctl[] = { 
	SYSCTL_PERIPH_WTIMER0, SYSCTL_PERIPH_WTIMER1, SYSCTL_PERIPH_WTIMER2,
	SYSCTL_PERIPH_WTIMER3, SYSCTL_PERIPH_WTIMER4, SYSCTL_PERIPH_WTIMER5 };
#endif

#endif //EMULATE_PWM



// Port/pin information for all channels
#if defined(FORLM3S1968)

  const static u32 pwm_ports[] =  { GPIO_PORTG_BASE, GPIO_PORTD_BASE, GPIO_PORTH_BASE, 
						GPIO_PORTH_BASE, GPIO_PORTF_BASE, GPIO_PORTF_BASE };
  const static u8 pwm_pins[] = { GPIO_PIN_2, GPIO_PIN_1, GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_2, GPIO_PIN_3 };

#elif defined(FORLM3S6965)

  const static u32 pwm_ports[] =  { GPIO_PORTF_BASE, GPIO_PORTD_BASE, GPIO_PORTB_BASE, 
						GPIO_PORTB_BASE, GPIO_PORTE_BASE, GPIO_PORTE_BASE };
  const static u8 pwm_pins[] = { GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_0, GPIO_PIN_1 };

#elif defined( ELUA_BOARD_SOLDERCORE ) && defined( FORLM3S9D92 )

  const static u32 pwm_ports[] =  { GPIO_PORTG_BASE, GPIO_PORTD_BASE, GPIO_PORTD_BASE, GPIO_PORTD_BASE, 
						GPIO_PORTE_BASE, GPIO_PORTE_BASE, GPIO_PORTC_BASE, GPIO_PORTC_BASE };
  const static u8 pwm_pins[] = { 	GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_2, GPIO_PIN_3, 
						GPIO_PIN_6, GPIO_PIN_7,  GPIO_PIN_4,  GPIO_PIN_6 };
  const static u32 pwm_configs[] = { GPIO_PG0_PWM0, GPIO_PD1_PWM1, GPIO_PD2_PWM2, GPIO_PD3_PWM3, 
						GPIO_PE6_PWM4, GPIO_PE7_PWM5, GPIO_PC4_PWM6, GPIO_PC6_PWM7 };

#elif defined( FORLM3S9B92 ) || ( defined(FORLM3S9D92) && !defined( ELUA_BOARD_SOLDERCORE ) )

  const static u32 pwm_ports[] =  { GPIO_PORTD_BASE, GPIO_PORTD_BASE, GPIO_PORTD_BASE, GPIO_PORTD_BASE, 
						GPIO_PORTE_BASE, GPIO_PORTE_BASE, GPIO_PORTC_BASE, GPIO_PORTC_BASE };
  const static u8 pwm_pins[] = { 	GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_2, GPIO_PIN_3, 
						GPIO_PIN_6, GPIO_PIN_7,  GPIO_PIN_4,  GPIO_PIN_6 };
  const static u32 pwm_configs[] = { GPIO_PD0_PWM0, GPIO_PD1_PWM1, GPIO_PD2_PWM2, GPIO_PD3_PWM3, 
						GPIO_PE6_PWM4, GPIO_PE7_PWM5, GPIO_PC4_PWM6, GPIO_PC6_PWM7 };

#elif defined( FORLM4F120 ) 
// FIXME FORLM4F120 has no PWM, simulate PWM using timers
// TODO: At the moment just using wide timers, could look at possible using arbitrary timers (based on which pin want PWMd)

  const static u32 pwm_ports[] = {  GPIO_PORTC_BASE, GPIO_PORTC_BASE, GPIO_PORTD_BASE,
						GPIO_PORTD_BASE, GPIO_PORTD_BASE, GPIO_PORTD_BASE};
  const static u8 pwm_pins[] = {    GPIO_PIN_4, GPIO_PIN_6, GPIO_PIN_0, 
						GPIO_PIN_2, GPIO_PIN_4,  GPIO_PIN_6 };

  const static u32 pwm_configs[] = { GPIO_PC4_WT0CCP0, GPIO_PC6_WT1CCP0, GPIO_PD0_WT2CCP0, 
						GPIO_PD2_WT3CCP0, GPIO_PD4_WT4CCP0, GPIO_PD6_WT5CCP0};

#elif defined( FORLM4F230 ) 

// Has two PWM modules - PWM_BASE0, PWM_BASE1 each with 4 generators, 8 pins, 8 PWM_OUTs
// TODO: Parameterize better (number of modules, number pins/module, etc.)
//   so get better error checking on various mappings,
//   so fewer cases for different CPUs 
//   make easier to add a new CPU

// TODO: Maybe way to chose alternative pins for PWMS (PWM6 C4 vs D0, PWM7 C5 vs D1, PWM10 A6 vs E4, PWM11 A7 vs E5)
// However - the alternate pins are also handled by other PWMs D0 is PWM8, etc., so may not need to handle map

// Module0, 8 PWMS PORTB:4-7, E:4-5, C:4-5 [or] D:0-1, fault on D:2 or D:6 or F:2
// Module1, 8 PWMS PORTD:0-1, A:6-7 [or] E:4-5, F:0-3, fault on F:4

  const static u32 pwm_ports[] = {  GPIO_PORTB_BASE, GPIO_PORTB_BASE, GPIO_PORTB_BASE, GPIO_PORTB_BASE, 
						GPIO_PORTE_BASE, GPIO_PORTE_BASE, GPIO_PORTC_BASE, GPIO_PORTC_BASE, 
						GPIO_PORTD_BASE, GPIO_PORTD_BASE, GPIO_PORTA_BASE, GPIO_PORTA_BASE,
						GPIO_PORTF_BASE, GPIO_PORTF_BASE, GPIO_PORTF_BASE, GPIO_PORTF_BASE  };
  const static u8 pwm_pins[] = {    GPIO_PIN_6, GPIO_PIN_7, GPIO_PIN_4, GPIO_PIN_5,
						GPIO_PIN_4, GPIO_PIN_5, GPIO_PIN_4, GPIO_PIN_5,
						GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_6, GPIO_PIN_7,
						GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_2, GPIO_PIN_3 };

  const static u32 pwm_configs[] = { GPIO_PB6_M0PWM0, GPIO_PB7_M0PWM1, GPIO_PB4_M0PWM2, GPIO_PB5_M0PWM3, 
						GPIO_PE4_M0PWM4, GPIO_PE5_M0PWM5, GPIO_PC4_M0PWM6, GPIO_PC5_M0PWM7, 
						GPIO_PD0_M1PWM0, GPIO_PD1_M1PWM1, GPIO_PA6_M1PWM2, GPIO_PA7_M1PWM3, 
						GPIO_PF0_M1PWM4, GPIO_PF1_M1PWM5, GPIO_PF2_M1PWM6, GPIO_PF3_M1PWM7 };

#elif defined( FORLM3S6918 )

// TODO: So why is this here, why doesn't the 6918 just not build the PWM code?
  const static u32 pwm_ports[] = {};
  const static u8 pwm_pins[] = {};

#else

  const static u32 pwm_ports[] =  { GPIO_PORTF_BASE, GPIO_PORTG_BASE, GPIO_PORTB_BASE, 
						GPIO_PORTB_BASE, GPIO_PORTE_BASE, GPIO_PORTE_BASE };
  const static u8 pwm_pins[] = { GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_0, GPIO_PIN_1 };

#endif


// PWM modules

