ecdr/elua/src/platform/lm3s/platform.c
// Module has at most 8 PWM channels
#define PWM_PER_MOD 8
// TODO: Use this parameter instead of >> 3

#if (PWM_PER_MOD * 2 < NUM_PWM)
#error Need to extend support for more than 2 PWM modules
#elif (PWM_PER_MOD < NUM_PWM)
#define NUM_PWM_MOD 2
#else
#define NUM_PWM_MOD 1
#endif

#if (NUM_PWM_MOD == 2)
  const static u32 pwm_base[] = { PWM0_BASE, PWM1_BASE };
#warning 2 PWM Mod
#else
  const static u32 pwm_base[] = { PWM_BASE };
#warning 1 PWM Mod
#endif

// FIXME: Range checks to be sure arrays filled in - need to fix syntax
/*
#if ((sizeof(pwm_base)/sizeof(u32)) < (NUM_PWM >> 3))
#error Not enough pwm_base
#endif
*/


// PWM generators
// Up to 4 generators per module

#if defined( FORLM3S9B92 ) || defined(FORLM3S9D92)
  const static u16 pwm_gens[] = { PWM_GEN_0, PWM_GEN_1, PWM_GEN_2, PWM_GEN_3 };

#elif defined( FORLM4F230 )
  const static u16 pwm_gens[] = { PWM_GEN_0, PWM_GEN_1, PWM_GEN_2, PWM_GEN_3,
    PWM_GEN_0, PWM_GEN_1, PWM_GEN_2, PWM_GEN_3 };

    //MODULE1 PWM_GEN_2 Covers M1PWM4 and M1PWM5
    //MODULE1 PWM_GEN_3 Covers M1PWM6 and M1PWM7 See page 207 4/11/13 DriverLib doc
    
#else 
  const static u16 pwm_gens[] = { PWM_GEN_0, PWM_GEN_1, PWM_GEN_2 };
#endif

/*
#if (sizeof(pwm_gens)/sizeof(u16) < (NUM_PWM/2))
#error Not enough pwm_gens
#endif
//  assert( id >> 1 < sizeof(pwm_gens)/ sizeof( u16 ));
*/


// PWM outputs
#if defined( FORLM3S9B92 ) || defined(FORLM3S9D92) || defined( FORLM4F230 ) 
const static u16 pwm_outs[] = { PWM_OUT_0, PWM_OUT_1, PWM_OUT_2, PWM_OUT_3, 
					PWM_OUT_4, PWM_OUT_5, PWM_OUT_6, PWM_OUT_7};
/*
#elif defined( FORLM4F230 ) 
const static u16 pwm_outs[] = { PWM_OUT_0, PWM_OUT_1, PWM_OUT_2, PWM_OUT_3, 
					PWM_OUT_4, PWM_OUT_5, PWM_OUT_6, PWM_OUT_7,
          PWM_OUT_0, PWM_OUT_1, PWM_OUT_2, PWM_OUT_3, 
					PWM_OUT_4, PWM_OUT_5, PWM_OUT_6, PWM_OUT_7
          };

// since second module same PWM_OUTs as first, 
// Use array covering one module, and modulo in access code
*/

#else
const static u16 pwm_outs[] = { PWM_OUT_0, PWM_OUT_1, PWM_OUT_2, PWM_OUT_3, PWM_OUT_4, PWM_OUT_5 };
#endif

/*
#if (sizeof(pwm_outs)/sizeof(u16) < NUM_PWM)
#error Not enough pwm_outs
#endif
*/


// TODO: What do these do on a system with no PWMs?
static void pwms_init()
{
#if defined( EMULATE_PWM )
//TODO: Write me!!
//  for(id = 0; id < NUM_PWM; id++)
//	pwm_enabled[id] = FALSE;

#else

  unsigned i;

#if (NUM_PWM_MOD == 2)
// TODO: Generalize to more than 2 PWM modules
  MAP_SysCtlPeripheralEnable( SYSCTL_PERIPH_PWM0 );
  MAP_SysCtlPeripheralEnable( SYSCTL_PERIPH_PWM1 );

#else
  MAP_SysCtlPeripheralEnable( SYSCTL_PERIPH_PWM );
#endif // NUM_PWM_MOD
  
  MAP_SysCtlPWMClockSet( SYSCTL_PWMDIV_1 );

  for ( i = 0; i < NUM_PWM; i++)
    MAP_PWMGenConfigure( pwm_base[i >> 3], pwm_gens[ i >> 1 ], PWM_GEN_MODE_UP_DOWN | PWM_GEN_MODE_NO_SYNC );
// PWMGenConfigure was in platform_pwm_setup, and it seemed to work on EK-LM3S8962
// However the Stellarisware documentation says that it leaves the generator disabled.
// The Stellarisware code does not appear to disable the generator (version 9453)
// However processor may be using ROM code.
// Having problems running on the Tiva launchpad.
// TODO: Check Tiva LP to see if running a start after configure fixes the problem (or moving configure out of platform_pwm_setup).

// FIXME: eLua documentation does not specify what (if any) effect platform_pwm_setup should have on the start/stoped status of the PWM.
// The example code seems to assume that platform_pwm_setup will not stop the generator.

// FIXME: Documentation says that this leaves the generator disabled.  So would have to call start after each time change period.
//   That is not how the example program works.  
// However, I thought this code and the example worked on the EK-LM3S8962
//
// Although the documentation says that this leaves the PWM disabled, I do not see in the library code where that is the case.
//   However - since may be using the library in ROM, the code it is running may not be the code in the library source.
//     (i.e. they may have fixed the Tivaware code to match documentation)
//
// Check eLua documentation (what is it supposed to do) - unspecified.  
// Check how functions work on other platforms - on AVR32 and LPC17xx it looks like platform_pwm_setup does not stop the PWM.
  
#endif // EMULATE_PWM
}

// Return the PWM clock
u32 platform_pwm_get_clock( unsigned id )
{
#ifdef EMULATE_PWM
  return MAP_SysCtlClockGet();

#else
  unsigned i;
  u32 clk;

  clk = MAP_SysCtlPWMClockGet();
  for( i = 0; i < sizeof( pwm_div_ctl ) / sizeof( u32 ); i ++ )
    if( clk == pwm_div_ctl[ i ] )
      break;
  return MAP_SysCtlClockGet() / pwm_div_data[ i ];
#endif // EMULATE_PWM
}

// Set the PWM clock
u32 platform_pwm_set_clock( unsigned id, u32 clock )
{
#ifdef EMULATE_PWM
  return MAP_SysCtlClockGet();

#else
  unsigned i, min_i;
  u32 sysclk;

  sysclk = MAP_SysCtlClockGet();
  for( i = min_i = 0; i < sizeof( pwm_div_data ) / sizeof( u8 ); i ++ )
    if( ABSDIFF( clock, sysclk / pwm_div_data[ i ] ) < ABSDIFF( clock, sysclk / pwm_div_data[ min_i ] ) )
      min_i = i;
  MAP_SysCtlPWMClockSet( pwm_div_ctl[ min_i ] );
  return sysclk / pwm_div_data[ min_i ];
#endif // EMULATE_PWM
}


//duty - PWM channel duty cycle, specified as integer from 0 to 100 (percent).
u32 platform_pwm_setup( unsigned id, u32 frequency, unsigned duty )
{
  u32 pwmclk = platform_pwm_get_clock( id );
  u32 period;
  
#if defined( FORLM3S9B92 ) || defined( FORLM3S9D92 ) || defined( FORLM4F120 ) || defined( FORLM4F230 )
  GPIOPinConfigure( pwm_configs[ id ] );
#endif

#ifdef EMULATE_PWM

// Assumes that GPIO for pins (sysctrl) have already been enabled by PIO module

//TODO: Be sure timer disabled before making changes
//  if allow timer to be used as PWM or timer, then need to keep track of use
//TODO: Maybe belong in general init 
  if (!pwm_enabled[id]){	// Initialize timer if not already set up
	MAP_GPIOPinTypeTimer( pwm_ports[id], pwm_pins[id] ); 
	MAP_SysCtlPeripheralEnable( pwm_timer_base[id] );	
	MAP_TimerConfigure( pwm_timer_base[id], TIMER_CFG_SPLIT_PAIR|TIMER_CFG_A_PWM );
	pwm_enabled[id] = TRUE;
  }

