ecdr/elua/src/platform/lm3s/platform.c
  // Try to read one byte from buffer, if none available return -1 or
  // retry if timeout
  // FIXME: Respect requested timeout
  do {
    read = USBBufferRead(&g_sRxBuffer, &data, 1);
  } while( read == 0 && timeout != 0 );

  if( read == 0 )
    return -1;
  else
    return data;
}

unsigned long TxHandler(void *pvCBData, unsigned long ulEvent, unsigned long ulMsgValue, void *pvMsgData)
{
  // Which event was sent?
  switch(ulEvent)
  {
    case USB_EVENT_TX_COMPLETE:
    {
        // Nothing to do, already handled by USBBuffer
        break;
    }
      
    default:
        break;
  }
  
  return(0);
}

unsigned long RxHandler(void *pvCBData, unsigned long ulEvent, unsigned long ulMsgValue, void *pvMsgData)
{
  unsigned long ulCount;
  unsigned char ucChar;
  unsigned long ulRead;


  // Which event was sent?
  switch(ulEvent)
  {
    // A new packet has been received.
    case USB_EVENT_RX_AVAILABLE:
    {
      break;
    }

    //
    // This is a request for how much unprocessed data is still waiting to
    // be processed.  Return 0 if the UART is currently idle or 1 if it is
    // in the process of transmitting something.  The actual number of
    // bytes in the UART FIFO is not important here, merely whether or
    // not everything previously sent to us has been transmitted.
    //
    case USB_EVENT_DATA_REMAINING:
    {
      //
      // Get the number of bytes in the buffer and add 1 if some data
      // still has to clear the transmitter.
      //
      return(0);
    }

    //
    // This is a request for a buffer into which the next packet can be
    // read.  This mode of receiving data is not supported so let the
    // driver know by returning 0.  The CDC driver should not be sending
    // this message but this is included just for illustration and
    // completeness.
    //
    case USB_EVENT_REQUEST_BUFFER:
    {
      return(0);
    }

    // Other events can be safely ignored.
    default:
    {
      break;
    }
  }

  return(0);
}

unsigned long
ControlHandler(void *pvCBData, unsigned long ulEvent, unsigned long ulMsgValue,
               void *pvMsgData)
{
  switch(ulEvent) // Check event
  {
    // The host has connected.
    case USB_EVENT_CONNECTED:
    {
      USBBufferFlush(&g_sTxBuffer);
      USBBufferFlush(&g_sRxBuffer);
      break;
    }

    
    // The host has disconnected.
    
    case USB_EVENT_DISCONNECTED:
    {
      break;
    }
    
    // Return the current serial communication parameters.
    case USBD_CDC_EVENT_GET_LINE_CODING:
    {
      break;
    }

    // Set the current serial communication parameters.
    case USBD_CDC_EVENT_SET_LINE_CODING:
    {
      break;
    }

    
    // Set the current serial communication parameters.
    case USBD_CDC_EVENT_SET_CONTROL_LINE_STATE:
    {
      break;
    }

    //
    // Send a break condition on the serial line.
    //
    case USBD_CDC_EVENT_SEND_BREAK:
    {
      break;
    }

    //
    // Clear the break condition on the serial line.
    //
    case USBD_CDC_EVENT_CLEAR_BREAK:
    {
      break;
    }

    //
    // Ignore SUSPEND and RESUME for now.
    //
    case USB_EVENT_SUSPEND:
    case USB_EVENT_RESUME:
    {
      break;
    }

    //
    // Other events can be safely ignored.
    //
    default:
    {
      break;
    }
  }

  return(0);
}

#endif // BUILD_USB_CDC

// ****************************************************************************
// Flash access functions

#ifdef BUILD_WOFS
u32 platform_s_flash_write( const void *from, u32 toaddr, u32 size )
{
  return MAP_FlashProgram( ( unsigned long * )from, toaddr, size );
}

int platform_flash_erase_sector( u32 sector_id )
{
  return FlashErase( sector_id * INTERNAL_FLASH_SECTOR_SIZE ) == 0 ? PLATFORM_OK : PLATFORM_ERR;
}
#endif // #ifdef BUILD_WOFS

// ****************************************************************************
// Platform specific modules go here

/* This all was removed from master - don't know what it did

#if defined( ENABLE_DISP ) || defined( ENABLE_LM3S_GPIO )

#define MIN_OPT_LEVEL 2
#include "lrodefs.h"

extern const LUA_REG_TYPE disp_map[];
extern const LUA_REG_TYPE lm3s_pio_map[];

const LUA_REG_TYPE platform_map[] =
{
#if LUA_OPTIMIZE_MEMORY > 0
#ifdef ENABLE_DISP
  { LSTRKEY( "disp" ), LROVAL( disp_map ) },
#endif
#ifdef ENABLE_LM3S_GPIO
  { LSTRKEY( "pio" ), LROVAL( lm3s_pio_map ) },
#endif
#endif
  { LNILKEY, LNILVAL }
};

LUALIB_API int luaopen_platform( lua_State *L )
{
#if LUA_OPTIMIZE_MEMORY > 0
  return 0;
#else // #if LUA_OPTIMIZE_MEMORY > 0
  luaL_register( L, PS_LIB_TABLE_NAME, platform_map );

  // Setup the new tables inside platform table
  lua_newtable( L );
  luaL_register( L, NULL, disp_map );
  lua_setfield( L, -2, "disp" );
  lua_newtable( L );
  luaL_register( L, NULL, lm3s_pio_map );
  lua_setfield( L, -2, "pio" );

  return 1;
#endif // #if LUA_OPTIMIZE_MEMORY > 0
}

#else // #if defined( ENABLE_DISP ) || defined( ENABLE_LM3S_GPIO )

LUALIB_API int luaopen_platform( lua_State *L )
{
  return 0;
}

#endif // #if defined( ENABLE_DISP ) || defined( ENABLE_LM3S_GPIO )

*/


// Assertion failure error handler
// TODO: Give feedback on console, and place for breakpoint for debugging

#ifdef DEBUG
void
__error__(char *pcFilename, unsigned long ulLine)
{
}
#endif

